# -*- coding: utf-8 -*-
"""
Created on Mon Sep  7 15:23:19 2020

@author: hyr
拼接，统计字数，将空格改为换行，查找子串，
"""

songs = '''等风雨经过
等我们相见
你微笑仰望着天
我们一起种下心愿
等花开等它实现
该流的泪还是滑过你的脸
我始终在你身边
说好要一起走很远
努力让未来鲜艳
在爱面前需要什么字眼
对你的承诺我一定实现
真正的爱不需要有太多语言
有些感动就放在心里面
在爱面前需要什么字眼
付出的瞬间也就是永远
每天离希望又再靠近了一点
守护家园是最美画面
我们为爱奉献
为梦改变'''

################begin#############
# 1. 添加字符串'武汉加油：《等风雨经过》由周杰伦作曲，方文山填词，张学友演唱。'作为歌曲首行,并输出整首歌曲
# 请注意中英文标点符号的输入
print('武汉加油：《等风雨经过》由周杰伦作曲，方文山填词，张学友演唱。\n' + songs)
################end#############












